## 데이터 베이스 설치 

- pip install mysql-connector-python

In [25]:
import pandas as pd

import pymysql

In [26]:
import mysql.connector

In [27]:
mysql_con = mysql.connector.connect(host='127.0.0.1', port='3306', database='sakila', user='root', password='')

In [28]:
pd.read_sql_query('show databases', mysql_con)

/var/folders/h4/44486vyn1_xbs13g1z50l5m00000gn/T/ipykernel_21563/3140938958.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('show databases', mysql_con)

             Database
0  information_schema
1           modu_chat
2                mydb
3               mysql
4  performance_schema
5              sakila
6                 sys

In [29]:
df2 = pd.read_sql('select * from actor limit 10', mysql_con)

/var/folders/h4/44486vyn1_xbs13g1z50l5m00000gn/T/ipykernel_21563/52531566.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql('select * from actor limit 10', mysql_con)

In [30]:
df2

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
5         6      BETTE     NICHOLSON 2006-02-15 04:34:33
6         7      GRACE        MOSTEL 2006-02-15 04:34:33
7         8    MATTHEW     JOHANSSON 2006-02-15 04:34:33
8         9        JOE         SWANK 2006-02-15 04:34:33
9        10  CHRISTIAN         GABLE 2006-02-15 04:34:33